app/admin/dashboard.rb

SELECT  "categories".* FROM "categories" ORDER BY created_at DESC LIMIT $1  [["LIMIT", 5]]
---

  content title: proc{ I18n.t('active_admin.dashboard') } do
    panel 'Last categories' do
      table_for Category.order('created_at DESC').limit(5) do |category|

SELECT  "comments".* FROM "comments" ORDER BY created_at DESC LIMIT $1  [["LIMIT", 5]]
---
    end

    panel 'Last comments' do
      table_for Comment.order('created_at DESC').limit(5) do |comment|

SELECT  "images".* FROM "images" ORDER BY created_at DESC LIMIT $1  [["LIMIT", 10]]
---
    end

    panel 'Last images' do
      table_for Image.order('created_at DESC').limit(10) do |image|

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
          image_tag(img.picture.thumb_small.url, alt: 'Image')
        end
        column :user_id do |img|
          User.find(img.user_id).username
        end
        column :category_id do |img|
          Category.find(img.category_id).name