app/admin/images.rb

INSERT INTO "images" ("path", "user_id", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["path", "pexels-photo-170811.jpeg"], ["user_id", 6], ["category_id", 39], ["created_at", "2018-10-10 13:03:27.426439"], ["updated_at", "2018-10-10 13:03:27.426439"]]
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 39], ["LIMIT", 1]]
UPDATE "categories" SET "count" = COALESCE("count", 0) + 1 WHERE "categories"."id" = $1  [["id", 39]]
---
    def create
      @image = Image.new(permitted_params[:image])

      if @image.save
        Category.find(@image.category_id).increment!(:count)

SELECT  "images".* FROM "images" WHERE "images"."id" = $1 LIMIT $2  [["id", 75], ["LIMIT", 1]]
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 39], ["LIMIT", 1]]
UPDATE "categories" SET "count" = COALESCE("count", 0) - 1 WHERE "categories"."id" = $1  [["id", 39]]
DELETE FROM "images" WHERE "images"."id" = $1  [["id", 75]]
---
    def destroy
      @image = Image.find(params[:id])
      Category.find(@image.category_id).decrement!(:count)
      @image.destroy