app/views/comments/_comment.html.haml

    =t('comments._comment.user')
    = User.find(comment.user_id).username
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]