app/controllers/categories_controller.rb

  def index
    @category = Category.new
    @categories = Category.all
---
SELECT "categories".* FROM "categories"

  def create
    @category = Category.new(category_param)
    @category.user_id = current_user.id

    if @category.save
---
INSERT INTO "categories" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "serts"], ["user_id", 1], ["created_at", "2018-10-08 12:34:15.453620"], ["updated_at", "2018-10-08 12:34:15.453620"]]

  def update
    @category.update(category_param)
---
UPDATE "categories" SET "name" = $1, "updated_at" = $2 WHERE "categories"."id" = $3  [["name", "123"], ["updated_at", "2018-10-09 10:50:08.043030"], ["id", 17]]

  def destroy
    @category.destroy
---
DELETE FROM "categories" WHERE "categories"."id" = $1  [["id", 9]]

  def find_category
    @category = Category.friendly.find(params[:id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]