app/controllers/comments_controller.rb

  def create
    @comment = Image.find(params[:image_id]).comments.new(comment_params)
    @comment.user_id = current_user.id

    if @comment.save!
---
SELECT  "images".* FROM "images" WHERE "images"."id" = $1 LIMIT $2  [["id", 63], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "image_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "sadasd"], ["image_id", 63], ["user_id", 1], ["created_at", "2018-10-10 10:05:52.748151"], ["updated_at", "2018-10-10 10:05:52.748151"]]