app/controllers/images_controller.rb

SELECT "images".* FROM "images"
---
  def index
    @images = Image.all.page(params[:page]).per(20)

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
  def find_category
    @category = Category.friendly.find(params[:category_id])