app/controllers/images_controller.rb

SELECT  "images".* FROM "images" WHERE "images"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show_category
    @images = Image.where('category_id = ?', params[:id])

INSERT INTO "images" ("path", "user_id", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["path", "pexels-photo-120049.jpeg"], ["user_id", 1], ["category_id", 27], ["created_at", "2018-10-09 13:18:13.478429"], ["updated_at", "2018-10-09 13:18:13.478429"]]
---
  def create
    @image = Image.new(image_param)

    if @image.save

DELETE FROM "images" WHERE "images"."id" = $1  [["id", 55]]
---
  def destroy
    id = category_id
    decrement_category_img
    @image.destroy

SELECT  "images".* FROM "images" WHERE "images"."id" = $1 LIMIT $2  [["id", 64], ["LIMIT", 1]]
---
  def find_image
    @image = Image.find(params[:id])

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 35], ["LIMIT", 1]]
UPDATE "categories" SET "count" = COALESCE("count", 0) + 1 WHERE "categories"."id" = $1  [["id", 35]]
---
  def increment_category_img
    Category.find(@image.category_id).increment!(:count)